Revit 2027 API
SymbolTypeId.Degree Property
 Symbol °, indicating unit Degrees.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Degree { get; }
Public Shared ReadOnly Property Degree As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Degree {
	ForgeTypeId^ get ();
}
static member Degree : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SymbolTypeId Class
Autodesk.Revit.DB Namespace